#include <stdio.h>
int main()
{
	//////用索引
	////int arr[3][5] =
	////{
	////	{1,2,3,4,5},
	////	{11,22,33,44,55},
	////	{111,222,333,444,555}
	////};
	////for (int i = 0;i < 3;i++)//行
	////{
	////	for (int j = 0;j < 5;j++)//列
	////	{
	////		printf ("%d ", arr[i][j]);
	////	}
	////	printf("\n");
	////}


	////int* arr[3] = { arr1,arr2,arr3 };//存的是一维数组的内存地址

	////for (int i = 0;i < 3;i++)
	////{
	////	for (int j = 0;j < lenarr[i];j++)
	////	{
	////		printf("%d ", arr[i][j]);
	////	}
	////	printf("\n");
	////}





	////用指针遍历
	//int arr[3][5] =
	//{
	//	{1,2,3,4,5},
	//	{11,22,33,44,55},
	//	{111,222,333,444,555}
	//};
	//int (*p)[5] = arr; //指向一维数组的指针  类型是一维数组的类型
	///*printf("%p\n", p);
	//printf("%p\n", p + 1);*/
	////进行遍历
	//for (int i = 0;i < 3;i++)
	//{
	//	//遍历一维数组
	//	for (int j = 0;j < 5;j++)
	//	{
	//		printf("%d ", *(*(p + i) + j));//等价于printf("%d ", p[i][j]);   也可以起到移动指针到下一个一维数组的作用
	//	}
	//	printf("\n");
	//	//指针移动到下一行
	//	//p++;
	//}


	int arr1[] = {1,2,3,4,5};
	int arr2[] = {11,22,33,44,55};
    int arr3[] = {111,222,333,444,555};
	int* arr[3] = { arr1,arr2,arr3 };//存的是一维数组的内存地址
	int** p = arr;//二级指针指向一维数组的地址 arr[i]就是一维数组的地址 因此p的类型是int*
	for (int i = 0;i < 3;i++)
	{
		for (int j = 0;j < 5;j++)
		{
			printf("%d ", *(*(p + i) + j));
		}
		printf("\n");
	}



	return 0;
}